## 실습02

In [ ]:
import numpy as np
import pandas as pd

In [188]:
df = pd.DataFrame(np.random.randint(1, 100, size=(15, 3)),
index=[['1학년','1학년','1학년','1학년','1학년','2학년','2학년','2학년','2학년','2학년','3학년','3학년','3학년','3학년','3학년'],
['1반','2반','3반','4반','5반','1반','2반','3반','4반','5반','1반','2반','3반','4반','5반']],
columns=['국어','영어','과학'])

In [158]:
df['총점'] = df['국어'] + df['영어'] + df['과학']

In [160]:
df["평균"] = df['총점'] / 3

In [172]:
df

        국어  영어  과학   총점         평균
1학년 1반  42  94  12  148  49.333333
    2반  63  94  78  235  78.333333
    3반  91  64  82  237  79.000000
    4반  25  56  19  100  33.333333
    5반  49  58   9  116  38.666667
2학년 1반  46  94  90  230  76.666667
    2반  42  17  76  135  45.000000
    3반  96  74  30  200  66.666667
    4반  14  60  70  144  48.000000
    5반   9  91  39  139  46.333333
3학년 1반  29  66   4   99  33.000000
    2반   5  19  41   65  21.666667
    3반  10  82  19  111  37.000000
    4반   9  63  32  104  34.666667
    5반  43  81  93  217  72.333333

In [175]:
df_index = df
df_index.index.names=['학년','반']

In [182]:
df_index = df_index.groupby('학년').sum()

In [186]:
df_index['평균'] = df_index['평균']/5
df_index

      국어   영어   과학   총점         평균
학년
1학년  270  366  200  836  55.733333
2학년  207  336  305  848  56.533333
3학년   96  311  189  596  39.733333

## 실습03

In [297]:
#df 선언
df_titanic = pd.read_csv('titanic_train.csv')

### 실습 03-1 결측지처리를해주세요.(age-평균값적용,Cabin-N으로,Embarked-N)

In [299]:
df_titanic['Age'] = df_titanic['Age'].fillna(df_titanic['Age'].mean())
df_titanic['Cabin'] = df_titanic['Cabin'].fillna('N')
df_titanic['Embarked'] = df_titanic['Embarked'].fillna('N')

### 실습03-2 성별(Sex)생존자합을구해주세요

In [300]:
df_titanic.groupby('Sex').sum()['Survived']

Sex
female    233
male      109
Name: Survived, dtype: int64

### 실습03-3 클래스(Pclass)별생존자합을구해주세요

In [301]:
df_titanic.groupby('Pclass').sum()['Survived']

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

### 실습03-4 나이(Age)를활용유아,10대,20대,30대,40대,50대,60대,노인의생존자합을구해주세요.

In [305]:
conlist = [(df_titanic['Age']<10),
((df_titanic['Age']>=10) & (df_titanic['Age']<20)),
((df_titanic['Age']>=20) & (df_titanic['Age']<30)),
((df_titanic['Age']>=30) & (df_titanic['Age']<40)),
((df_titanic['Age']>=40) & (df_titanic['Age']<50)),
((df_titanic['Age']>=50) & (df_titanic['Age']<60)),
((df_titanic['Age']>=60) & (df_titanic['Age']<70)),
(df_titanic['Age'])>=70]

choilist =['유아','10대','20대','30대','40대','50대','60대','노인']

df_titanic["Ages"] = np.select(conlist,choilist,default='Not Specified')

df_titanic.groupby('Ages').mean()['Survived']

Ages
10대    0.401961
20대    0.324937
30대    0.437126
40대    0.382022
50대    0.416667
60대    0.315789
노인     0.142857
유아     0.612903
Name: Survived, dtype: float64

## 실습03
### 실습03-1 30대이면서1등석에탄사람의수

In [310]:
df_titanic[(df_titanic["Ages"] == '30대')&(df_titanic['Pclass'] == 1)]['Pclass'].count()

50

### 실습03-2 클래스(Pclass)별나이평균

In [309]:
df_titanic.groupby("Pclass").mean()['Age']

Pclass
1    37.048118
2    29.866958
3    26.403259
Name: Age, dtype: float64

### 실습03-3 클래스(Pclass)와성별에따른생존율

In [311]:
df_titanic.groupby(['Pclass','Sex']).mean()['Survived']

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

### 실습 03-4 나이(Age)대별로생존율구하기

In [296]:
df_titanic2 = pd.read_csv('titanic_train.csv')

conlist = [(df_titanic2['Age']<10),
((df_titanic2['Age']>=10) & (df_titanic2['Age']<20)),
((df_titanic2['Age']>=20) & (df_titanic2['Age']<30)),
((df_titanic2['Age']>=30) & (df_titanic2['Age']<40)),
((df_titanic2['Age']>=40) & (df_titanic2['Age']<50)),
((df_titanic2['Age']>=50) & (df_titanic2['Age']<60)),
((df_titanic2['Age']>=60) & (df_titanic2['Age']<70)),
((df_titanic2['Age']>=70) & (df_titanic2['Age']<80)),
(df_titanic2['Age']>=80)]

choilist =['0','10','20','30','40','50','60','70','80']

df_titanic2["Ages_2"] = np.select(conlist,choilist,default='-1')

df_titanic2.groupby('Ages_2').mean()['Survived']

Ages_2
-1    0.293785
0     0.612903
10    0.401961
20    0.350000
30    0.437126
40    0.382022
50    0.416667
60    0.315789
70    0.000000
80    1.000000
Name: Survived, dtype: float64